app/controllers/contatos_controller.rb

SELECT "contatos".* FROM "contatos"
---
  def index
    @contatos = Contato.all

SELECT "contatos".* FROM "contatos" WHERE "contatos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @contato = Contato.find(params[:id])

SELECT "contatos".* FROM "contatos" WHERE "contatos"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @contato = Contato.find(params[:id])

INSERT INTO "contatos" ("created_at", "mail", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 29 Jun 2013 21:45:24 UTC +00:00], ["mail", "jonathas_ruam@hotmail.com"], ["name", "jonathas"], ["phone", "9941-4125"], ["updated_at", Sat, 29 Jun 2013 21:45:24 UTC +00:00]]
---
  def create
    @contato = Contato.new(params[:contato])

    respond_to do |format|
      if @contato.save

SELECT "contatos".* FROM "contatos" WHERE "contatos"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "contatos" SET "name" = 'Kelly Capuleto', "updated_at" = '2013-06-29 21:46:59.964796' WHERE "contatos"."id" = 2
---
  def update
    @contato = Contato.find(params[:id])

    respond_to do |format|
      if @contato.update_attributes(params[:contato])

SELECT "contatos".* FROM "contatos" WHERE "contatos"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "contatos" WHERE "contatos"."id" = ?  [["id", 3]]
---
  def destroy
    @contato = Contato.find(params[:id])
    @contato.destroy